//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
// 
//**********************************************************************

//**********************************************************************
//<AMI_FHDR_START>
//
// Name:	FastBoot.uni
//
// Description:	FastBoot Setup strings definitions
//
//<AMI_FHDR_END>
//**********************************************************************

/=#
#include "VFR.uni"

#string STR_FAST_BOOT                   #language eng "Fast Boot"
#string STR_FAST_BOOT_HELP              #language eng "Enables or disables boot with initialization of a minimal set of devices required to launch active boot option. Has no effect for BBS boot options."
#string STR_FAST_BOOT_BANNER_ONE        #language eng "WARNING!!! WARNING!!! WARNING!!!"
#string STR_FAST_BOOT_BANNER_TWO        #language eng "You are about enabling FAST BOOT!" 
#string STR_FAST_BOOT_BANNER_THREE      #language eng "Please refer to user manual about" 
#string STR_FAST_BOOT_BANNER_FOUR       #language eng "additional requirements"

#string STR_FB_SATA                      #language eng " SATA Support"
#string STR_FB_SATA_HELP                 #language eng ""
#string STR_FB_USB                      #language eng " USB Support"
#string STR_FB_USB_HELP                 #language eng "If Disabled, all USB devices will NOT be available until after OS boot. If Partial Initial, USB Mass Storage and specific USB port/device will NOT be available before OS boot. If Enabled, all USB devices will be available in OS and Post."

#string STR_FB_PS2                      #language eng " PS2 Devices Support"
#string STR_FB_PS2_HELP                 #language eng "If Disabled, PS2 devices will be skipped."

#string STR_FB_VGA                      #language eng " VGA Support"
#string STR_FB_VGA_HELP                 #language eng "If Auto, only install Legacy OpRom with Legacy OS and logo would NOT be shown during post. Efi driver will still be installed with EFI OS."

#string STR_FB_NETWORK_STACK            #language eng " NetWork Stack Driver Support"
#string STR_FB_NETWORK_STACK_HELP       #language eng "If Disabled, NetWork Stack Driver will be skipped."

#string STR_FB_TEST                     #language eng "Fast Boot Test Mode"
#string STR_FB_TEST_HELP                #language eng "Attempt to boot with \\EFI\\Dp\\BootX64.efi when fastboot enabled."
#string STR_ENABLE                      #language eng "Enabled"
#string STR_DISABLE                     #language eng "Disabled"
#string STR_FULL_INIT                   #language eng "Full Initial"
#string STR_PATIAL_INIT                 #language eng "Partial Initial"
#string STR_VGA_DRIVER                  #language eng "EFI Driver"
#string STR_AUTO                        #language eng "Auto"
#string STR_SATA_HDD_ONLY               #language eng "HDD Only"
#string STR_SATA_ALL                    #language eng "All Sata Devices"
#string STR_SATA_LAST_BOOT_ONLY         #language eng "Last Boot HDD Only"
//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
